[
  "Sardar Patel Dental College, Lucknow offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 5504. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 7002. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 2911. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 4387. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12550. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 12476. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 17680. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 7487. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 2131. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 5147. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 5233. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11668. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13638. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 16045. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18124. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not filled. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sardar Patel Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19196. Fee: ₹9,48,600/-. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9604. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11570. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 11164. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11508. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 8613. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 7034. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12737. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 16793. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18174. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19597. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDST Dental College, Modinagar, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹7,67,600. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Career Post Graduate Dental College, Lucknow offers MDS - Endodontics under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of 7893. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Endodontics under Minority quota for General category in round round 1 with a cutoff rank of 7099. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Prosthodontics under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of 12689. Fee: ₹5,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Prosthodontics under Minority quota for General category in round round 1 with a cutoff rank of 10110. Fee: ₹5,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Prosthodontics under Minority quota for General category in round round 2 with a cutoff rank of 10878. Fee: ₹5,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Prosthodontics under Minority quota for General category in round round 3 with a cutoff rank of 8665. Fee: ₹5,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Periodontics under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of 16799. Fee: ₹3,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Periodontics under Minority quota for General category in round round 1 with a cutoff rank of 11628. Fee: ₹3,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Periodontics under Minority quota for General category in round round 2 with a cutoff rank of 14473. Fee: ₹3,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Periodontics under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹3,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Periodontics under Minority quota for General category in round round 4 with a cutoff rank of 16146. Fee: ₹3,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Orthodontics under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of 12383. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Orthodontics under Minority quota for General category in round round 1 with a cutoff rank of 5580. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Orthodontics under Minority quota for General category in round round 2 with a cutoff rank of 11790. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Surgery under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of 5140. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Surgery under Minority quota for General category in round round 1 with a cutoff rank of 5980. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Surgery under Minority quota for General category in round round 2 with a cutoff rank of 4654. Fee: ₹6,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Pedodontics under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of 6059. Fee: ₹4,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Pedodontics under Minority quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹4,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Pedodontics under Minority quota for General category in round round 2 with a cutoff rank of 11895. Fee: ₹4,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Pedodontics under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹4,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Pedodontics under Minority quota for General category in round round 4 with a cutoff rank of 14462. Fee: ₹4,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for Muslim Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for Muslim Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for Muslim Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 1 with a cutoff rank of 7607. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 4 with a cutoff rank of 21450. Fee: ₹2,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for Muslim Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for Muslim Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for Muslim Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Oral Pathology under Minority quota for General category in round round 4 with a cutoff rank of 21123. Fee: ₹1,50,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for Muslim Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for Muslim Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for Muslim Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for Muslim Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for General category in round round 1 with a cutoff rank of 8248. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for General category in round round 3 with a cutoff rank of 15966. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Career Post Graduate Dental College, Lucknow offers MDS - Public Health under Minority quota for General category in round round 4 with a cutoff rank of 21263. Fee: ₹2,00,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Muslim",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Endodontics under Minority quota for Jain Minority category in round round 1 with a cutoff rank of 10214. Fee: ₹6,21,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Endodontics under Minority quota for Jain Minority category in round round 2 with a cutoff rank of 11983. Fee: ₹6,21,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Endodontics under Minority quota for General category in round round 1 with a cutoff rank of 11147. Fee: ₹6,21,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Prosthodontics under Minority quota for Jain Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹4,95,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Prosthodontics under Minority quota for Jain Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹4,95,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Prosthodontics under Minority quota for Jain Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹4,95,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Prosthodontics under Minority quota for Jain Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹4,95,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Prosthodontics under Minority quota for General category in round round 1 with a cutoff rank of 5805. Fee: ₹4,95,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Prosthodontics under Minority quota for General category in round round 2 with a cutoff rank of 8580. Fee: ₹4,95,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Prosthodontics under Minority quota for General category in round round 3 with a cutoff rank of 11738. Fee: ₹4,95,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for Jain Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for Jain Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for Jain Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for Jain Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for General category in round round 1 with a cutoff rank of 6933. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for General category in round round 2 with a cutoff rank of 9304. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for General category in round round 3 with a cutoff rank of 11034. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Periodontics under Minority quota for General category in round round 4 with a cutoff rank of 14600. Fee: ₹2,97,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Orthodontics under Minority quota for Jain Minority category in round round 1 with a cutoff rank of 13608. Fee: ₹5,94,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Orthodontics under Minority quota for General category in round round 1 with a cutoff rank of 10083. Fee: ₹5,94,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Orthodontics under Minority quota for General category in round round 2 with a cutoff rank of 10097. Fee: ₹5,94,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Surgery under Minority quota for Jain Minority category in round round 1 with a cutoff rank of 10702. Fee: ₹6,21,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Surgery under Minority quota for General category in round round 1 with a cutoff rank of 5281. Fee: ₹6,21,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Surgery under Minority quota for General category in round round 2 with a cutoff rank of 7812. Fee: ₹6,21,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for Jain Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for Jain Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for Jain Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for Jain Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for General category in round round 1 with a cutoff rank of 9597. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for General category in round round 2 with a cutoff rank of 12775. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for General category in round round 3 with a cutoff rank of 1789. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Pedodontics under Minority quota for General category in round round 4 with a cutoff rank of 14447. Fee: ₹3,33,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for Jain Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for Jain Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for Jain Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for Jain Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 1 with a cutoff rank of 3229. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 2 with a cutoff rank of 9092. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 3 with a cutoff rank of 10365. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 4 with a cutoff rank of 18076. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for Jain Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for Jain Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for Jain Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for Jain Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Oral Pathology under Minority quota for General category in round round 4 with a cutoff rank of 22437. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for Jain Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for Jain Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for Jain Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for Jain Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for General category in round round 1 with a cutoff rank of 4009. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Teerthankar Mahaveer Dental College, Mordabad offers MDS - Public Health under Minority quota for General category in round round 4 with a cutoff rank of 22584. Fee: ₹1,98,000/-. College Type: nan. Counseling by Uttar Pradesh. Minority: Jain",
  "Sharda Dental College, Greater Noida offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 6655. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 7130. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 8174. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 4570. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 3992. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 8614. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 6928. Fee: ₹769400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12690. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 15191. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 808. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13123. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 12780. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹150000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹150000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹150000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Sharda Dental College, Greater Noida offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹150000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11335. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12402. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9086. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 9431. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12719. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13284. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18321. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13497. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 7898. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 15625. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Chandra Dental College, Barabanki offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 11559. Fee: ₹542100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 4892. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9006. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 2206. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 8224. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 5811. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 7330. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12578. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 11049. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 21972. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Saraswati Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹621228. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12346. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 15771. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18739. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11353. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18650. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 6676. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18487. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13496. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 16703. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Azamgarh Dental College, Azamgarh offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 12582. Fee: ₹707100. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9681. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 10343. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 8081. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13244. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13660. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13689. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 11022. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9543. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19365. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13846. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Inderprastha Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 17879. Fee: ₹765000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 13476. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 12767. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 15136. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 10387. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13070. Fee: ₹859700. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 14545. Fee: ₹700000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹700000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹700000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 16872. Fee: ₹700000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18677. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 7156. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 16016. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13634. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 12969. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 17279. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 5494. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Shree Bankey Bihari Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19379. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9247. Fee: ₹728000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13370. Fee: ₹649000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹649000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹649000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 22038. Fee: ₹649000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 8103. Fee: ₹728000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 8687. Fee: ₹728000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10795. Fee: ₹649000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13144. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 14366. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 17260. Fee: ₹500000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13316. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 6509. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18027. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 7671. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13370. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Babu Banarasi Das Dental College, Lucknow offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 22038. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 12758. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 17510. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18329. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 12341. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 16515. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18813. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 20482. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11373. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kalka Dental College, Meerut offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19596. Fee: ₹590000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 6006. Fee: ₹775000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 7944. Fee: ₹775000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 4505. Fee: ₹806400. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 5417. Fee: ₹625000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 3695. Fee: ₹625000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10893. Fee: ₹525000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13947. Fee: ₹525000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 8087. Fee: ₹525000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12672. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 13241. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11674. Fee: ₹325000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹325000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 8549. Fee: ₹325000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 17592. Fee: ₹325000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "IDS Dental College, Bareilly offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9512. Fee: ₹670000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 8918. Fee: ₹670000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13394. Fee: ₹670000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹670000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 7224. Fee: ₹670000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 9207. Fee: ₹670000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12752. Fee: ₹525000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 8389. Fee: ₹525000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13688. Fee: ₹450000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13962. Fee: ₹450000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10375. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 14816. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 16349. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹200000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹200000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹200000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹200000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹225000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹225000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 3383. Fee: ₹225000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "K.D. Dental College, Mathura offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18362. Fee: ₹225000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10548. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10104. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 10372. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 6107. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 7243. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10865. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 11188. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 9466. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 15257. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 11219. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13195. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 14032. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10242. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19060. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 18938. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Kothiwal Dental College, Moradabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12235. Fee: ₹672300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11271. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 13198. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 15987. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 16212. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 7236. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 10079. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13612. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10022. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 10932. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9993. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19270. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 21452. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Rama Dental College, Kanpur offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19905. Fee: ₹803300. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 1460. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 1531. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 3355. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 1471. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 2700. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 2465. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 749. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 2531. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 3468. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 5292. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 9938. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 4617. Fee: ₹497000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 13816. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 4367. Fee: ₹300000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "Subharti Dental College, Meerut offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹275000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 5985. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 5736. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 11963. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 14086. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 1471. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 2700. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 6788. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 8952. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 13981. Fee: ₹816000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12086. Fee: ₹650000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 11945. Fee: ₹550000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Greator Noida offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 17761. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 6145. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Endodontics under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 10678. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Orthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 6209. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Surgery under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 7071. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 5699. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Prosthodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of 7982. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Pedodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 12116. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 8698. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Periodontics under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of 10600. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 10913. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Medicine & Radiology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of UTTAR PRADESH NEET MDS ALLOTMENT 2024 UTTAR PRADESH NEET MDS ALLOTMENT 2024 100% 18 D53  14603      \t 14603 Turn on screen reader support To enable screen reader support, press Ctrl+Alt+Z To learn about keyboard shortcuts, press Ctrl+slash. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of 7202. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Public Health under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19807. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "ITS Dental College, Ghaziabad offers MDS - Oral Pathology under Management Quota - All Domicile Candidates quota for General category in round round 4 with a cutoff rank of 19905. Fee: ₹810000. College Type: nan. Counseling by Uttar Pradesh. Minority: None",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Endodontics under Minority quota for General category in round round 4 with a cutoff rank of 18091. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Orthodontics under Minority quota for General category in round round 4 with a cutoff rank of 18168. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for General category in round round 1 with a cutoff rank of 9758. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Surgery under Minority quota for General category in round round 4 with a cutoff rank of 16105. Fee: ₹825000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for General category in round round 2 with a cutoff rank of 12856. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for General category in round round 3 with a cutoff rank of 13996. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Prosthodontics under Minority quota for General category in round round 4 with a cutoff rank of 17780. Fee: ₹600000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for General category in round round 1 with a cutoff rank of 10325. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Pedodontics under Minority quota for General category in round round 4 with a cutoff rank of 17749. Fee: ₹475000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for General category in round round 1 with a cutoff rank of 4125. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Periodontics under Minority quota for General category in round round 4 with a cutoff rank of 19422. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 1 with a cutoff rank of 13446. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Medicine & Radiology under Minority quota for General category in round round 4 with a cutoff rank of 15278. Fee: ₹400000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for General category in round round 1 with a cutoff rank of 15862. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Public Health under Minority quota for General category in round round 4 with a cutoff rank of 14993. Fee: ₹350000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for Sikh Minority category in round round 1 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for Sikh Minority category in round round 2 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for Sikh Minority category in round round 3 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for Sikh Minority category in round round 4 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for General category in round round 1 with a cutoff rank of 4670. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for General category in round round 2 with a cutoff rank of 15994. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "D.J. DENTAL COLLEGE, MODI NAGAR offers MDS - Oral Pathology under Minority quota for General category in round round 4 with a cutoff rank of 17107. Fee: ₹250000. College Type: nan. Counseling by Uttar Pradesh. Minority: Sikh",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 688. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for UR category in round round 3 with a cutoff rank of 1751. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for Scheduled Caste category in round round 1 with a cutoff rank of 4705. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for Scheduled Caste category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for Scheduled Caste category in round round 3 with a cutoff rank of 5246. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 4281. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 3 with a cutoff rank of 4592. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Medicine & Radiology under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 13765. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for UR category in round round 1 with a cutoff rank of 2325. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for UR category in round round 3 with a cutoff rank of 6445. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Management Quota category in round round 4 with a cutoff rank of 17909. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for UR category in round round 1 with a cutoff rank of 684. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for UR category in round round 3 with a cutoff rank of 1122. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Other Backward Class B category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Other Backward Class B category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Other Backward Class B category in round round 3 with a cutoff rank of 2661. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Scheduled Caste category in round round 1 with a cutoff rank of 3803. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Scheduled Caste category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Scheduled Caste category in round round 3 with a cutoff rank of 7561. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 5394. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of 3393. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 10511. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for UR category in round round 3 with a cutoff rank of 747. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Scheduled Tribe category in round round 1 with a cutoff rank of 4069. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Scheduled Tribe category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Scheduled Tribe category in round round 3 with a cutoff rank of 3803. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 6445. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of 8263. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 858. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for UR category in round round 3 with a cutoff rank of 2325. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 12062. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 13765. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 1120. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Scheduled Caste category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Scheduled Caste category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Scheduled Caste category in round round 3 with a cutoff rank of 8327. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 7423. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 11300. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for Other Backward Class B category in round round 1 with a cutoff rank of 1449. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 12634. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 8559. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 4 with a cutoff rank of 16255. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Public Health under Government Quota quota for Scheduled Caste category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Public Health under Government Quota quota for Scheduled Caste category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Public Health under Government Quota quota for Scheduled Caste category in round round 3 with a cutoff rank of 4705. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Public Health under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Public Health under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Public Health under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Guru Nanak Dev Dental College, Kolkata offers MDS - Public Health under Government Quota quota for Management Quota category in round round 4 with a cutoff rank of 14688. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 167. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for Other Backward Class A category in round round 1 with a cutoff rank of 401. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for UR category in round round 1 with a cutoff rank of 115. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 92. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Other Backward Class A category in round round 1 with a cutoff rank of Not. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Other Backward Class A category in round round 2 with a cutoff rank of Not Filled. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Other Backward Class A category in round round 3 with a cutoff rank of 1826. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 207. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Scheduled Tribe category in round round 1 with a cutoff rank of 2173. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Economically Weaker Section category in round round 1 with a cutoff rank of 233. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Economically Weaker Section category in round round 2 with a cutoff rank of 1020. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for Other Backward Class A category in round round 1 with a cutoff rank of 806. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Dr R Ahmed Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Scheduled Tribe category in round round 1 with a cutoff rank of 6493. Fee: ₹2000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Endodontics under Private State Quota quota for Unreserved category in round round 1 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Endodontics under Private State Quota quota for Unreserved category in round round 2 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Endodontics under Private State Quota quota for Unreserved category in round round 3 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Endodontics under Private State Quota quota for Unreserved category in round round 4 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Periodontics under Private State Quota quota for Unreserved category in round round 1 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Periodontics under Private State Quota quota for Unreserved category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Periodontics under Private State Quota quota for Unreserved category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Periodontics under Private State Quota quota for Unreserved category in round round 4 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Prosthodontics under Private State Quota quota for Unreserved category in round round 1 with a cutoff rank of Not Filled. Fee: ₹500000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Prosthodontics under Private State Quota quota for Unreserved category in round round 2 with a cutoff rank of Not Filled. Fee: ₹500000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Prosthodontics under Private State Quota quota for Unreserved category in round round 3 with a cutoff rank of Not Filled. Fee: ₹500000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Prosthodontics under Private State Quota quota for Unreserved category in round round 4 with a cutoff rank of Not Filled. Fee: ₹500000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for Unreserved - Women category in round round 1 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for Unreserved - Women category in round round 2 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for Unreserved - Women category in round round 3 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for Unreserved - Women category in round round 4 with a cutoff rank of 16370. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for Unreserved - Women category in round round 1 with a cutoff rank of Not Filled. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for Unreserved - Women category in round round 2 with a cutoff rank of 9977. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Endodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 11170. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 6736. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for UR category in round round 2 with a cutoff rank of 7130. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Orthodontics under Private State Quota quota for UR category in round round 3 with a cutoff rank of 15861. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Pedodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Pedodontics under Private State Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Pedodontics under Private State Quota quota for UR category in round round 3 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Pedodontics under Private State Quota quota for UR category in round round 4 with a cutoff rank of Not Filled. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Periodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 15574. Fee: ₹400000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Uttranchal Dental College, Dehradun offers MDS - Prosthodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 12371. Fee: ₹500000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Seema Dental College, Rishikesh offers MDS - Endodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 7465. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Seema Dental College, Rishikesh offers MDS - Orthodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 8980. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Seema Dental College, Rishikesh offers MDS - Orthodontics under Private State Quota quota for UR category in round round 2 with a cutoff rank of 7698. Fee: ₹709000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Seema Dental College, Rishikesh offers MDS - Pedodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 9693. Fee: ₹509000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Seema Dental College, Rishikesh offers MDS - Periodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 11179. Fee: ₹479000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Seema Dental College, Rishikesh offers MDS - Prosthodontics under Private State Quota quota for UR category in round round 1 with a cutoff rank of 10322. Fee: ₹579000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Seema Dental College, Rishikesh offers MDS - Prosthodontics under Private State Quota quota for UR category in round round 2 with a cutoff rank of 10303. Fee: ₹579000. College Type: nan. Counseling by Uttrakhand. Minority: None",
  "Government Dental College, Shimla offers MDS - Pedodontics under State Quota quota for General category in round round 1 with a cutoff rank of 800. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Periodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Periodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Periodontics under State Quota quota for General category in round round 3 with a cutoff rank of 1265. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Public Health under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Public Health under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Public Health under State Quota quota for General category in round round 3 with a cutoff rank of 1682. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Endodontics under State Quota quota for EWS category in round round 1 with a cutoff rank of 3116. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Oral Surgery under State Quota quota for SC category in round round 1 with a cutoff rank of 3179. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Prosthodontics under State Quota quota for SC category in round round 1 with a cutoff rank of 1356. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Oral Medicine & Radiology under State Quota quota for PwD category in round round 1 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Oral Medicine & Radiology under State Quota quota for PwD category in round round 2 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Oral Medicine & Radiology under State Quota quota for PwD category in round round 3 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Oral Medicine & Radiology under State Quota quota for PwD category in round round 4 with a cutoff rank of Not Filled. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Government Dental College, Shimla offers MDS - Oral Medicine & Radiology under State Quota quota for General category in round round 1 with a cutoff rank of 453. Fee: ₹30000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Endodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Endodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Endodontics under State Quota quota for General category in round round 3 with a cutoff rank of 7207. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Orthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 2814. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Orthodontics under State Quota quota for General category in round round 2 with a cutoff rank of 7911. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Orthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 9862. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Pedodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Pedodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Pedodontics under State Quota quota for General category in round round 3 with a cutoff rank of 13333. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 1 with a cutoff rank of 2552. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Prosthodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Prosthodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Prosthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 8239. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Endodontics under State Quota quota for ST category in round round 1 with a cutoff rank of 6721. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Endodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Endodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Endodontics under State Quota quota for General category in round round 3 with a cutoff rank of 3683. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Orthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 10066. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Orthodontics under State Quota quota for General category in round round 2 with a cutoff rank of 8590. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Orthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 11246. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Pedodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Pedodontics under State Quota quota for General category in round round 2 with a cutoff rank of 13333. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Pedodontics under State Quota quota for General category in round round 3 with a cutoff rank of 13361. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Periodontics under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Prosthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 2527. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Prosthodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Prosthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 12273. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Bhojia Dental College, Nalagarh offers MDS - Orthodontics under State Quota quota for ST category in round round 1 with a cutoff rank of 15357. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 501. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Endodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 7503. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 747. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Orthodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 5582. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 1311. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 10207. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Other Backward Class A category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Other Backward Class A category in round round 2 with a cutoff rank of 6850. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 9314. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 8787. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 4 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 5 with a cutoff rank of 14203. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Scheduled Caste category in round round 1 with a cutoff rank of 7561. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Scheduled Caste category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Scheduled Caste category in round round 3 with a cutoff rank of 12970. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 13862. Fee: ₹600000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Pathology under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of Not Filled. Fee: ₹600000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Scheduled Caste category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Scheduled Caste category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Scheduled Caste category in round round 3 with a cutoff rank of 8561. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Pedodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 12316. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 8032. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Kusum Devi Dental College, Kolkata offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 9843. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Endodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Endodontics under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Endodontics under Government Quota quota for UR category in round round 3 with a cutoff rank of 2742. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Endodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 6699. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 1 with a cutoff rank of 1815. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 3 with a cutoff rank of 6082. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 4 with a cutoff rank of 8109. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Medicine & Radiology under Government Quota quota for UR category in round round 5 with a cutoff rank of 3479. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Medicine & Radiology under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 11936. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for UR category in round round 1 with a cutoff rank of 1122. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for UR category in round round 3 with a cutoff rank of 1184. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Other Backward Class A category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Other Backward Class A category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Other Backward Class A category in round round 3 with a cutoff rank of 11821. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Other Backward Class A category in round round 4 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Other Backward Class A category in round round 5 with a cutoff rank of 18515. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 6768. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of 6800. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Oral Surgery under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 8478. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Pedodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of 1184. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Pedodontics under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Pedodontics under Government Quota quota for UR category in round round 3 with a cutoff rank of 3865. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Pedodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 11811. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Pedodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of 10292. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for UR category in round round 3 with a cutoff rank of 3170. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for UR category in round round 4 with a cutoff rank of 13048. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 13489. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 4 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Periodontics under Government Quota quota for Management Quota category in round round 5 with a cutoff rank of 19026. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Prosthodontics under Government Quota quota for UR category in round round 1 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Prosthodontics under Government Quota quota for UR category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Prosthodontics under Government Quota quota for UR category in round round 3 with a cutoff rank of 1831. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 9843. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Prosthodontics under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 7909. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Orthodontics under Government Quota quota for Scheduled Caste category in round round 1 with a cutoff rank of 4845. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Orthodontics under Government Quota quota for Scheduled Caste category in round round 2 with a cutoff rank of Not Filled. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Orthodontics under Government Quota quota for Scheduled Caste category in round round 3 with a cutoff rank of 12492. Fee: ₹300000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Orthodontics under Government Quota quota for Management Quota category in round round 1 with a cutoff rank of 10297. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Orthodontics under Government Quota quota for Management Quota category in round round 2 with a cutoff rank of Not Filled. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Haldia Dental College, Haldia offers MDS - Orthodontics under Government Quota quota for Management Quota category in round round 3 with a cutoff rank of 11716. Fee: ₹900000. College Type: nan. Counseling by West Bengal. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Endodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Endodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Endodontics under State Quota quota for General category in round round 3 with a cutoff rank of 11031. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 5 with a cutoff rank of 17394. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Surgery under State Quota quota for General category in round round 1 with a cutoff rank of 8407. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Surgery under State Quota quota for General category in round round 2 with a cutoff rank of 9574. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Surgery under State Quota quota for General category in round round 3 with a cutoff rank of 10178. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 4136. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 5 with a cutoff rank of 14578. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 5 with a cutoff rank of 15874. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Periodontics under State Quota quota for General category in round round 1 with a cutoff rank of 7207. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Periodontics under State Quota quota for General category in round round 2 with a cutoff rank of 9522. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Prosthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 8239. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Prosthodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Prosthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 11260. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Endodontics under State Quota quota for General category in round round 1 with a cutoff rank of 8458. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 1 with a cutoff rank of 12296. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Pathology under State Quota quota for General category in round round 5 with a cutoff rank of 14722. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 9606. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Orthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 13000. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Pedodontics under State Quota quota for General category in round round 5 with a cutoff rank of 17864. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Periodontics under State Quota quota for General category in round round 1 with a cutoff rank of 11179. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Periodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Periodontics under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Periodontics under State Quota quota for General category in round round 4 with a cutoff rank of 9593. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Periodontics under State Quota quota for General category in round round 5 with a cutoff rank of 19369. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Prosthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 10315. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Institute of Dental Sciences, Sirmour offers MDS - Oral Surgery under State Quota quota for SC category in round round 1 with a cutoff rank of 14096. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Endodontics under State Quota quota for General category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Endodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Endodontics under State Quota quota for General category in round round 3 with a cutoff rank of 11031. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 2735. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 2 with a cutoff rank of 2735. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 5336. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 4 with a cutoff rank of 5528. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for General category in round round 1 with a cutoff rank of 5903. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for General category in round round 3 with a cutoff rank of 13548. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for General category in round round 4 with a cutoff rank of 12062. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Periodontics under State Quota quota for General category in round round 1 with a cutoff rank of 5336. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Periodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Periodontics under State Quota quota for General category in round round 3 with a cutoff rank of 12750. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Periodontics under State Quota quota for General category in round round 5 with a cutoff rank of 17089. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 5382. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 8590. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Endodontics under State Quota quota for SC category in round round 1 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Endodontics under State Quota quota for SC category in round round 2 with a cutoff rank of Not Filled. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Endodontics under State Quota quota for SC category in round round 3 with a cutoff rank of 10661. Fee: ₹490863. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Endodontics under State Quota quota for General category in round round 1 with a cutoff rank of 3810. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 11208. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 3 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for General category in round round 5 with a cutoff rank of 14229. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for General category in round round 1 with a cutoff rank of 13382. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for General category in round round 2 with a cutoff rank of 13664. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Periodontics under State Quota quota for General category in round round 1 with a cutoff rank of 5210. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Periodontics under State Quota quota for General category in round round 2 with a cutoff rank of 12296. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Periodontics under State Quota quota for General category in round round 3 with a cutoff rank of 3911. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 1 with a cutoff rank of 11858. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 2 with a cutoff rank of 3144. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 3 with a cutoff rank of 13729. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 4 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Prosthodontics under State Quota quota for General category in round round 5 with a cutoff rank of 19046. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for ST category in round round 1 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for ST category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Orthodontics under State Quota quota for ST category in round round 3 with a cutoff rank of 15637. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for ST category in round round 1 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for ST category in round round 2 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for ST category in round round 3 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for ST category in round round 4 with a cutoff rank of Not Filled. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None",
  "Himachal Dental College, Sundernagar offers MDS - Pedodontics under State Quota quota for ST category in round round 5 with a cutoff rank of 17384. Fee: ₹650000. College Type: nan. Counseling by Himachal Pradesh. Minority: None"
]